trunk/app/controllers/alumnos_controller.rb

  def index
    @alumnos = Alumno.all
---
SELECT "alumnos".* FROM "alumnos"

  def show
    @alumno = Alumno.find(params[:id])
---
SELECT "alumnos".* FROM "alumnos" WHERE ("alumnos"."id" = 1) LIMIT 1

  def edit
    @alumno = Alumno.find(params[:id])
---
SELECT "alumnos".* FROM "alumnos" WHERE ("alumnos"."id" = 1) LIMIT 1

  def create
    @alumno = Alumno.new(params[:alumno])

    respond_to do |format|
      if @alumno.save
---
INSERT INTO "alumnos" ("nacionalidad", "cedula", "nombre", "apellido", "esta_activo", "created_at", "updated_at", "correo") VALUES ('V', 16384629, 'Leyda', 'Mendoza', 't', '2011-02-03 02:23:18.764372', '2011-02-03 02:23:18.764372', 'lmendoza@unefmtic.com.ve') RETURNING "id"

  def update
    @alumno = Alumno.find(params[:id])

    respond_to do |format|
      if @alumno.update_attributes(params[:alumno])
---
SELECT "alumnos".* FROM "alumnos" WHERE ("alumnos"."id" = 1) LIMIT 1
UPDATE "alumnos" SET "correo" = 'vincenzo@aol.com.ve', "updated_at" = '2011-02-01 02:51:00.452569' WHERE ("alumnos"."id" = 1)