trunk/app/controllers/inscripciones_controller.rb

  def index
    @inscripciones = Inscripcione.all
---
SELECT "inscripciones".* FROM "inscripciones"

  def show
    @inscripcione = Inscripcione.find(params[:id])
---
SELECT "inscripciones".* FROM "inscripciones" WHERE ("inscripciones"."id" = 1) LIMIT 1

  def edit
    @seccione = Seccione.find(params[:id])
    @alumnos = Alumno.all(:order => 'cedula')
---
SELECT "secciones".* FROM "secciones" WHERE ("secciones"."id" = 1) LIMIT 1
SELECT "alumnos".* FROM "alumnos" ORDER BY cedula

  def create
    @inscripcione = Inscripcione.new(params[:inscripcione])

    respond_to do |format|
      if @inscripcione.save
---
INSERT INTO "inscripciones" ("alumno_id", "seccione_id", "created_at", "updated_at") VALUES (1, NULL, '2011-02-01 03:30:02.054533', '2011-02-01 03:30:02.054533') RETURNING "id"

  def destroy
    @inscripcione = Inscripcione.find(params[:id])
    @inscripcione.destroy
---
SELECT "inscripciones".* FROM "inscripciones" WHERE ("inscripciones"."id" = 1) LIMIT 1
DELETE FROM "inscripciones" WHERE ("inscripciones"."id" = 1)