app/views/inscripciones/edit_multiple.html.erb

    <%= form.label :seccione_id, "Sección" %>
    <%= form.collection_select :seccione_id, Seccione.all, :id, :nombre, :prompt => true %>
---
SELECT "secciones".* FROM "secciones"