app/controllers/evaluaciones_controller.rb

  def index
    @evaluaciones = Evaluacione.all
---
SELECT "evaluaciones".* FROM "evaluaciones"

  def show
    @evaluacione = Evaluacione.find(params[:id])
---
SELECT "evaluaciones".* FROM "evaluaciones" WHERE ("evaluaciones"."id" = 1) LIMIT 1

  def edit
    @evaluacione = Evaluacione.find(params[:id])
---
SELECT "evaluaciones".* FROM "evaluaciones" WHERE ("evaluaciones"."id" = 1) LIMIT 1

  def create
    @evaluacione = Evaluacione.new(params[:evaluacione])

    respond_to do |format|
      if @evaluacione.save
---
INSERT INTO "evaluaciones" ("nombre", "descripcion", "fecha_ini", "fecha_fin", "seccione_id", "esta_activo", "created_at", "updated_at") VALUES ('Evaluacion 1', 'Evaluación 1', '2011-02-01', '2011-02-01', 1, 't', '2011-02-01 03:07:38.307632', '2011-02-01 03:07:38.307632') RETURNING "id"