app/controllers/periodos_controller.rb

SELECT "periodos".* FROM "periodos"
---
  def index
    @periodos = Periodo.all

SELECT "periodos".* FROM "periodos" WHERE ("periodos"."id" = 1) LIMIT 1
---
  def show
    @periodo = Periodo.find(params[:id])

INSERT INTO "periodos" ("nombre", "descripcion", "esta_abierto", "esta_activo", "created_at", "updated_at") VALUES ('Introductorio 2011-1', 'Período para el curso introductorio de la 1ra cohorte UNEFM Molino-Morón', 't', 't', '2011-02-01 00:45:12.494274', '2011-02-01 00:45:12.494274') RETURNING "id"
---
  def create
    @periodo = Periodo.new(params[:periodo])

    respond_to do |format|
      if @periodo.save