app/controllers/secciones_controller.rb

SELECT "secciones".* FROM "secciones"
---
  def index
    @secciones = Seccione.all

SELECT "secciones".* FROM "secciones" WHERE ("secciones"."id" = 1) LIMIT 1
---
  def show
    @seccione = Seccione.find(params[:id])

SELECT "secciones".* FROM "secciones" WHERE ("secciones"."id" = 1) LIMIT 1
---
  def edit
    @seccione = Seccione.find(params[:id])

INSERT INTO "secciones" ("nombre", "curso_id", "periodo_id", "esta_activo", "created_at", "updated_at") VALUES ('Ingeniería', 1, 1, NULL, '2011-02-01 02:21:26.363231', '2011-02-01 02:21:26.363231') RETURNING "id"
---
  def create
    @seccione = Seccione.new(params[:seccione])

    respond_to do |format|
      if @seccione.save

SELECT "secciones".* FROM "secciones" WHERE ("secciones"."id" = 1) LIMIT 1
UPDATE "secciones" SET "esta_activo" = 't', "updated_at" = '2011-02-01 02:25:17.998897' WHERE ("secciones"."id" = 1)
---
  def update
    @seccione = Seccione.find(params[:id])

    respond_to do |format|
      if @seccione.update_attributes(params[:seccione])